InformationRegisters/НапоминанияПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НапоминанияПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСледующегоНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СообщенияКПросмотру.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СообщенияКПросмотру</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Сообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/НапоминанияИнтервалыПереноса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>НапоминанияИнтервалыПереноса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минут5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минут15</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минут30</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завтра</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/НапоминанияПользователя/Forms/ФормаОповещения/Ext/Form/Module.bsl
&НаКлиенте
Перем Отказ Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Сообщения") Тогда		
		Список.ОсновнаяТаблица = "Задача.Сообщения";
		Список.ТекстЗапроса = ТекстЗапросаСообщения();
	КонецЕсли;
	Для Каждого Элемент Из Список.Параметры.Элементы Цикл
		Если Строка(Элемент.Параметр) = "Ответственный" Тогда
			Элемент.Значение = ПараметрыСеанса.ТекущийПользователь;
			Элемент.Использование = Истина;
		ИначеЕсли Строка(Элемент.Параметр) = "ТекущаяДата" Тогда
			Элемент.Значение = ТекущаяДата();
			Элемент.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	НапомнитьЧерез = Перечисления.НапоминанияИнтервалыПереноса.Минут15;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ,ЗавершениеРаботы,ТекстПредупреждения, СтандартнаяОбработка)
	//ПеренестиНапоминание(Отказ);
	
	Если Не ЗавершениеРаботы = Истина Тогда
		ПеренестиНапоминание(Отказ);
	Иначе
		Отказ = Истина;
		ТекстПредупреждения = "Выполняется закрытие окна напоминаний!";
		ПодключитьОбработчикОжидания("ПеренестиНапоминаниеЗавершение",1,Истина);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиНапоминаниеЗавершение()Экспорт
	ПеренестиНапоминание(Отказ);
КонецПроцедуры	

&НаСервере
Процедура ПеренестиНапоминание(Отказ)
	УстановитьПривилегированныйРежим(Истина);
	
	Набор = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
	Набор.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Набор.Прочитать();
	
	Набор.Пользователь = ПараметрыСеанса.ТекущийПользователь;	
	Набор.ДатаСледующегоНапоминания = ТекущаяДата() + Перечисления.НапоминанияИнтервалыПереноса.ПолучитьВСекундах(
	НапомнитьЧерез);
	
	Попытка
		Набор.Записать();
	Исключение
		Отказ = Истина;
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаСообщения()

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Сообщения.Ссылка КАК Ссылка,
		|	Сообщения.ПланируемаяДата КАК ПланируемаяДата
		|ИЗ
		|	РегистрСведений.СообщенияКПросмотру КАК СообщенияКПросмотру
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.Сообщения КАК Сообщения
		|		ПО СообщенияКПросмотру.Сообщение = Сообщения.Ссылка
		|ГДЕ
		|	СообщенияКПросмотру.Ответственный = &Ответственный";
	
	Возврат ТекстЗапроса;

КонецФункции // ТекстЗапросаСообщения()
